{"pages":[{"title":"分類","text":"","link":"/say-something/categories/index.html"},{"title":"關於我","text":"1997 年生，人類。想要好好生活就要好好紀錄！所以這邊常常分享一些我的心得。有任何想交流歡迎與我聯絡～(*´∀`)~♥ Gmail : chenxsuan019@gmail.com Fake it till you make it.","link":"/say-something/about/index.html"},{"title":"友情連結","text":"It’s Coding Time趙萌 – 可愛又迷人A反派角色","link":"/say-something/friends/index.html"},{"title":"tags","text":"","link":"/say-something/tags/index.html"}],"posts":[{"title":"讀書心得 - 偷書賊","text":"作者：馬格斯．朱薩克 我的評分：★★★★ 這本書約有四五百頁，利用抽空的時間大概兩週就可以看完，每次看這種譯本小說都看很快，因為太精彩了無法自拔的看下去，很想趕快看劇情是怎麼發展的。以前大學也很喜歡看譯本，對我來說就是長篇故事書，腦海中想像的畫面就像自己拍了一部電影一樣，饒富趣味。 故事大綱主要是環繞在第一次世界大戰與大二次之間在德國由希特勒統治且下令囚禁所有猶太人主軸背景之下，使用開場即結果的方式敘述，書名偷書賊其實就已經告訴我們內容了，而旁白是站在死神的世界觀敘述故事，從開頭的死亡，呼應結尾死亡，也從開頭主角的介紹結尾以主角收尾，但整體故事的發展，跟結尾都令人意想不到。 其中我最喜歡旁白描述主角媽媽的樣子，把媽媽說成「衣櫃」的身軀以及總是帶著嚴肅的方形「棋盤」臉，待人不友善、對人叫罵等等描述得非常生動，而溫暖且善良的主角爸爸也形成強烈對比，主角莉賽爾則是卻繼承了媽媽的一半兇悍爸爸一半的溫柔性格。 莉賽爾在焚燒書籍時偷書，在鎮長大人家偷書，在弟弟的喪禮上偷書，而這一切在共產國家下想要擁有文字就等於擁有想法，可以說是思想犯罪，但卻阻止不了她對於文字的渴望。整本書環繞著莉賽爾的家庭、鄰居魯迪一家人、猶太人麥可斯、戰爭的生活、貧民百姓、以及「書」。每個小人物刻畫都很細膩，真的會讓人不知不覺中投入在其中。 結尾的部分從倒數兩、三章節並沒有要收尾的意思，是等到最後一章節倉促的收尾再加上一個短篇的尾聲，個人覺得有點可惜，因為還在很投入的時候就莫名的加快故事速度結束了。大觀來說還是好看的一本書，偷書賊也有拍成電影，之後再找機會來看看。","link":"/say-something/2021/07/15/2021-July/Book-TheBookThief/"},{"title":"2021 八月雜記","text":"隨著疫情的趨緩，原本居家辦公的我在七月中的時候開始回公司工作了，總覺得時間過好快，感覺五月疫情剛開始很嚴重的時候，還沒搞清楚狀況就居家辦公到七月，八月整整開始都在公司上班（當然一整天也都戴口罩 QQ） 總結一下八月分都做了些什麼 股票課額外進修的股票課從四月一路上到八月，高階二班沒有繼續上，剛好在八月結束課程到一個段落，覺得有喘口氣的感覺，畢竟從四月到八月每個假日早上三小時還要每周定時繳交 2-5 份功課，壓力不算大但是多少都有點擔心考試沒過，但是也是很順利的畢業了。這幾個月在股票上學習到很多新知識以外，個人的人格特質也被股票老師圈了出來，像是不細心、心煩氣躁等等這些都是我需要改的問題，除了學股票也順便改變自己（？） 工作在工作上，六月時公司有位 PM 離職了，新來的 PM 還在熟悉狀況，所以七月好像也沒有什麼特別事情要忙，我開始上線上課程，精進自己的程式能力。上了約兩個月多後就沒有繼續購買課程，發現自己會主動開始找資源學習，系統化的學習和自主的練習等等這些習慣，在課程中已經學我得差不多了。不過後續有想要寫後端程式的話我會想要持續購買把它上完。而課程學習的東西確實有應用在工作上，在解 Bug 的時候不管是找資源或是詢問同事上，都有明顯的知道程式是在做什麼，最有趣的是，有一天看程式有一種豁然開朗的感覺 XD，我覺得這些都是課程和練習帶給我的反饋！未來也會持續往這個方向前進，不斷的增進自我。 同事在疫情趨緩的時候有位新同事到來，叫 Alvin，講話超問柔，也很有耐心！詢問他問題時心裡也會跟著平靜下來，我發現我喜歡講話溫柔的人，所以當我跟他相處的時候我也盡量學習，講話溫柔、小聲且有禮貌。Alvin 在操作網頁 CSS 的功力非常熟練，我之前有跟他說覺得自己寫的 CSS 都不乾淨，他說要依照畫面功能去寫，很多時候不是硬寫就可以解決問題的。而在工作上跟我說了一些觀念跟做法，是位值得學習的同事。 之前跟他聊天有聊到他也是最近才學框架那些，我問說你看文件都不會覺得很煩嗎，我有時候真的很懶得看文件就直接動手，他說他以前也是這樣，後來才發現文件上有太多東西可以避免踩雷，所以他現在都先看文件。他在學習新框架的時候也覺得很痛苦，果然每個人在學習的路上都是痛苦的。 健身月中旬健身房開始控管人數的開放，我的健身教練找我回去量 inbody，體重上並沒有因為疫情而放肆，但是肌肉掉了兩公斤，教練推測說可能是我碳水吃太少又只有有氧（之前七月份有一週固定幾天去外面慢跑四五公里，都有戴口罩），回歸健身房之後教練把我的營養素暫時做新的調整，我也結束了斷食減重的方式，變成每天計算好營養素搭配運動，首要目標仍舊是減脂（萬年不變），訓練上的重量跟之前做的都差蠻多的，不過我相信會慢慢變得強壯！我選擇相信自己。 長笛長笛課也持續進行中，不知不覺再兩個月就滿學一年了，還是個初階者，但是長笛老師有說我跟以往很不同了，現階段要開始在意吹奏的聲音好聽與否（以前只在乎有沒有吹出聲音），現在一天至少會花個三十分鐘練習，有時候吹得不錯會得到師丈的讚許哈哈！ 另外老師有詢問我是否有想要購買自己的長笛（目前是跟老師借），因為會有吹習慣以及熟悉的問題，所以老師認為我真的有興趣且願意繼續學下去的話可以購買好一些的長笛，最近也有在網路上看心得分享做了功課，打算明年買一把自己喜歡的中階款長笛（要好好存錢才行&gt;&lt;），長笛上有個小轉變是吹長笛的心態，原本是「想要當街頭藝人而去吹奏長笛」轉變成「我想要吹出好聽的音色給自己聽」，是為了自己而吹奏，不是為了別人。 總結九月開始做了新的生活調整，早上會早起一點看一點英文或是書，之前一直吵說要考多益，覺得也是時候開實踐這些事了（也希望以後能跟姐姐的男友交流順暢，動力之一），也另外記錄了運動的時間、讀書的時間、玩樂的時間，我想知道我一週都做了些什麼，時間究竟浪費在哪？再去慢慢調整。 八月份好多身邊的朋友換工作了，自己多少也有那些念頭浮現，好像是時候該去外面闖一闖了（？）但是我也告訴自己不是現在，不要受其他外物影響。這個八月是我第一個非暑假的八月，今年畢業生陸續開始找工作後，開始正式意識到自己已經不是學生樣了，我更在意的是如何讓自己更有能力，更像個成熟大人。 省思反思了一下自己，覺得自己還不夠珍惜現在擁有的，我對於吹長笛很感興趣其實也是最一開始老師借我長笛，如果老師只借我一下就要求我自己買一把，我覺得我可能不會練習得這麼勤奮，你會有種「老師如果把長笛收回去要我自己買一把的話怎麼辦 QQ？我要珍惜每一次練習可以用長笛的時候」。這個心態換到任何上面都是，健身房之前每天開的時候我也沒有去很勤，也不是很認真練，結果疫情下來不能去就是三個月，不珍惜可以訓練的時候，沒了才再後悔，都是無用的，而且自己想想我先天條件已經比別人好很多了，有什麼資格抱怨然後不努力呢？而工作上也是，工作沒有很忙碌的話，我為什麼不好好珍惜寫專案以外的時間，把時間拿來看別人的 Code 學點新東西什麼的都好。總而言之呢，我要珍惜現在且更加努力利用現有的資源，這是我八月的心情感觸。","link":"/say-something/2021/09/04/2021-Agust/2021-AgustRecord/"},{"title":"提醒 - 提醒自己用的幾句話","text":"紀錄一下幾句用來提醒自己的話 Fake it till you make it.「觀察時間大於動筆時間，三十分鐘觀察，十分鐘動筆」「細心是你缺乏的」「思考很重要」「熟能生巧、勤能補拙、大量練習」「查找記得看文件看筆記」「很多東西都是先藉由模仿去學習」更新 2021/07/17 「成功者善於模仿」","link":"/say-something/2021/07/17/2021-July/Remind-mine/"},{"title":"想法 - 興趣使然的東西，不會讓你忘記","text":"先想想，如果別人問你：「你的興趣是什麼？」你會怎麼回答？ 先說我好了，以前的我大概會說「我好像沒有什麼特別的興趣耶…」，大學期間儘管參加了一堆社團（熱舞社、網球社等等..），也都只是三分鐘熱度，似乎沒有真正能引起我注意的事情，但唯獨一件讓我從小持續到現在的事大概只有「閱讀」了吧！ 嘗試並不吃虧撇除掉閱讀這件事，從 20 年畢業，我確定自己的工作方向後就開始廣泛式的嘗試任何事情，一方面是覺得我現在還有時間可以去嘗試，一方面是覺得我還年輕還有體力，這就是我的本錢，我沒道理（？）不去揮霍，所以我開始做一些我沒做過的事，像是去高級餐廳、買幾件昂貴的衣服、開始上健身房、開始爬山、認識新朋友、學習新東西…等等，說起來好笑，幾位朋友聽到我開始做這些事，他們嘲弄著我說「辰宣，你又在解成就哦？」，是！就是在解成就XD 去年畢業知道自己找工作的方向，不從容的我給了自己一個月的 Gap Month，開始做一些新的嘗試，從最一開始的上健身房，想著「我就來看看我堅持三個月會怎樣？」，痛苦又漫長的三個月過去後，體脂降了約 3-4%，嚐到甜頭後就開始加入重訓，最瘋狂的時期甚至每天都去健身房運動兩小時，就這樣也默默堅持了七八個月到現在，說自己健身上癮真的也不為過，但最大的收穫應該還是體脂降了 10 幾 % 體重降了約十公斤吧！從油膩膩的泡芙變成稍微結實「看起來有在健身」的人。（之後會寫一篇心得，敬請期待） 體力好之後開始接觸爬山，第一次就爬了崩潰的谷關八唐縱走（附上連結，哪有人第一次爬山就爬 10、11 小時的稜線縱走啦！），自以為有上健身房體力不差，結果邊爬邊擦眼淚，想著我幹嘛沒事找事做，結果一下山又開始想「下一座要爬什麼好呢？」，真的是越虐我越愛（？）從此刻開始我不停的爬山。 結果，愛上爬山這件事，成為了我興趣之一！* 成為興趣，然後呢無奈身邊的朋友們都不太喜歡爬山（也是啦，又熱、又累、又曬完全可以理解每次邀約他們都被拒絕的原因），我開始網路上找團跟，臉皮厚的我甚至組了一個登山社團，開始號招大家來爬山，只要有開團有缺人我就跟，半年下來爬了十幾座山，除了中部的山以外，我開始查其他縣市的山，像是七星山、抹茶山、旗靈山等等，看著網路上的分享默默把名單放入我的爬山清單中。 後來我發現，當朋友問我什麼什麼山在哪或是哪團在揪人去哪座山的時候，我竟然可以完全不用查在哪，大概是什麼等級的山，這些資訊在我腦海中就浮現出來了（順口的講出來朋友甚至以為我都去過lol），我才意識到原來我感興趣的東西，會不自覺得去查相關資訊，不自覺得記入腦海中！ 我因為喜歡所以自己組了社團、做了很多功課，這些事如果是以前的我一定會覺得「蛤，好麻煩哦」，沒想到卻因為一次的崩潰縱走讓我愛上爬山，跟健身一樣完全上癮，有陣子因為工作比較忙當月沒有爬山我反而覺得心裡空空的，就像失戀的感覺一樣XD，此後每個月固定一次的爬山行程就納入我的行事曆了。 嘗試後變成了興趣，興趣卻讓你忘不了我想到在 19 年我申請上了北京交換生，其中最讓我印象深刻的是我和朋友一起去紫禁城遊玩，想說來穿個古裝拍照留下美好的紀念，在城旁租了一整套的古裝，當時幫我們上妝的小姐在為我們挑選古裝時，熱情的介紹著哪些服裝是哪個年代，哪些飾品是她手工製作，哪些古裝這樣設計的意涵，我看到她身上散發著光芒，我知道那是她的興趣，儘管工作室不到 15 坪小房間，也包不住她喜愛的事物！當時的我無法體會，但我知道她很享受她的興趣和工作。 連上妝她都很熱心跟我們介紹古裝的妝容是怎樣的 而從爬山這件事，我領悟到喜歡的東西你會花時間做研究、廣泛的搜尋，但卻樂在其中，如果今天遇到同好，你的眼睛會閃閃發光，因為你知道有人的興趣跟你一樣，就像為我們打扮古裝的小姐，熱情的分享自己的所愛。 爾後，我也持續嘗試了很多東西，一直堅持下去的當然不只爬山這件事，很感謝一開始自己願意踏出這一步，願意嘗試，從中找到樂趣，給自己一些甜頭，慢慢地堅持下去，儘管過程有崩潰、有難過，也不會隨便放棄，因為你知道這是你喜歡的事！ 最後，我想說的是不要害怕嘗試，失敗了也沒關係，找到自己的興趣，享受其中！ 用美美的照片收尾!","link":"/say-something/2021/06/08/2021-June/About-Habit/"},{"title":"讀書心得 - 過度飲食心理學：當人生只剩下吃是唯一慰藉","text":"作者：基瑪卡吉兒（Kima Cargill） 我的評分：★★★ 這本書算是偏冷門類型的（我在找二手書時，發現基本上沒人賣），知道這本也是去年聽某個 Podcasts 主持人的推薦，從今年年初購入，拖著拖著也過了半年才把它看完。除了書名加上心理學吸引我之外，更讓我感到有趣的是後面的 「當人生只剩下吃是唯一慰藉」，當我們將食物吃下時，究竟是快樂？還是罪惡？ 這本書用科學實證、種種文獻來告訴你，資本主義世界下所有消費者的行為，不管是食物、藥品..等等，都是商人的操控，甚至是連操控者也會掉入自己的陷阱中！ 消費行為導致的肥胖作者藉由案例帶我們進入病人的心理、生理狀況、消費行為，一連串的行為導致肥胖潮流盛行，越來越多因外貌沒自信輾轉尋求「吃」來當作藉慰滿足孤單感的現代人，吃下的罪惡卻造成心理上的壓力，無限的輪迴走不出來。 下意識的消費慾但除了被美食誘惑外，很多時候我們會在下意識的情況下購入那些不需要的「食物」，這種無意識的消費行為會因為看到商品的多樣陳列或精美的包裝，而激起「消費慾」。 以我自己來說好了，因為疫情的關係民生用品都是由家人一週一次的外出採買，上週因為衛生紙剛好沒了，我拿著皮包唯一目的就是買衛生紙，當我一進入賣場，冷氣迎面而來，各個商品映入眼簾，任誰都會不禁多逛一下，儘管我需要的只是幾捲衛生紙。等到我拿到今天的主角後，手上又多了一些不相干的商品，才意識的這就是「激起的消費慾」。 這樣的經驗不知道你是不是也經歷過幾次？更有研究指出商品的擺放，經過設計後，消費者購買的次數增多，最有名的例子就是「啤酒與尿布」 很多時候我們只是藉由消費來治療焦慮、喪失，虛無等各種無止境的慾望 為了消費而消費，被商人鼓吹煽動的消費慾讓我們瘋狂吃與買，是我們這個世代面臨的ㄧ大問題。消費和吃的連結滿足我們的快感，為了追尋快感，惡性的循環就從這裡開始，而肥胖也隨之找上門來。 抱歉了，我就是要吃那酷東西從農業到工業，食品也隨著時代更迭，加工商品早就遍佈全世界，現在一個食物的保存期限最長的保存是兩到三年都不會腐壞，還記得以前有個麥當勞漢堡放 24 年後長怎樣的故事嗎？食物豐富的同時我們不知道的是額外的添加物到底有多少，這也是為什麼大家推崇「原型食物」的原因，但，往往添加後的更好吃！ 從加工食品上找尋歸屬感 如同有品牌的鞋子、衣服、電子產品提供一種社會歸屬感，品牌食品也提供這類歸屬感，而且更便宜、更容易親近 作者提到不消費的時下的東西，就會被邊緣化。 以現在當紅的「BTS 麥當勞」套餐來說，廣告一出來後，我身邊的朋友至少有三個已經品嚐過了，不管是帶著粉絲的角度或是嚐鮮的角度，與 BTS 合作的商品，在我看來是成功的完美落地，至少在年輕族群間掀起了一陣「你吃過了嗎」的問候，而我到現在都沒吃過你會不會覺得我跟不上潮流呢？（我覺得答案是，會！）這就回到開頭說的，食物可以讓你成為話題人物，沒嚐過你就是不夠潮。 大部分的時候我們根本不在乎食品上的新鮮程度、營養程度，以外貌判斷美不美味，以新舊判斷是否符合當代，更不用說那些只有裝潢的店家，就是為了吸引大眾拍照才去。這都是一波未平一波又起發生的事。另外有趣的是當我帶自煮便當（無調味的原型食物）到公司的時候，同事會驚訝地說我怎麼吃這種便當，但其實這種原型食物才是對我們最健康的，食物的型態在不知不覺中改變了我們的想法和自我認同。 有如毒品的糖與甜味劑不知道你會不會跟我一樣，在購買時多瞄一眼背後的商品成分的組成。 像我早上喝的鮮奶，背後的糖是每一百毫升約 10 克，中午吃的空心菜每一百公克是 0 克 ，這些代表著食物的營養價值，但多少人在乎呢？但老實說，我津津有味吃著士力架時，當下的我也根本不在乎 \b！ 記得某次在聽廣播時主持人問來賓說「你覺得我們人體一天需要多少克的糖？」「不到 30 克吧」來賓天真的說著，「錯！答案是一點都不需要」 ，雖然國民飲食指標有寫道「每日飲食中，添加糖的攝取量不宜超過總熱量的 10%」，但有文件跟研究都指出人體跟不需要一丁點的糖。如果你注重保養那你更應該知道糖會加速人體皮膚的老化，糖就像毒品般一吃再吃的上癮（本書第六章節有詳細提到，對於糖的成癮跟毒品的成癮可以並提）。 天然到底是真的天然，還是假的天然 食用人工甜味劑形成一種可被接受的爆食症，可盡情吃任何自己渴望的食物，卻沒有負面的後果 注重健康的聲音日增漸多，很多主打無糖無脂肪的商品，都是另外添加了人工甜味劑，同樣的讓食物感到美味，卻不那麼罪惡，卻是額外的熱量殺手。 書中提到人工甜味劑的使用讓我們看見另一個消費循環，試圖解決消費某一種東西的問題（糖），卻又帶領我們去消費另一種東西（人工甜味劑），就像東牆補西牆一樣。人體會因為吃進去的食物會影響血糖的變化，當血糖一升高的情況下，會讓我們有更多想吃的慾望，就算我們身體不需要，或是早就感到飽足，這也是醫生一直提倡穩定血糖很重要的原因之一。 我平常就沒有喝飲料的習慣，有次跟朋友去爬山看到他帶了兩三罐的運動飲料，我好奇地問他說怎麼不帶水？他帶著疑問的表情說道「這就是水啊！」他似乎並不知道運動飲料的糖含量遠遠比水還要多太多了，這也不能錯怪他，畢竟電視廣告的渲染、外包裝的誤解，真的多少都會讓人覺得「運動飲料就是水」的錯誤觀念。 除了本書提到的「天然」用詞，額外想到台灣將在 2022 年開始執行健康字樣的規定，市面上太多使用「健康」一詞將垃圾食物合理化，混淆消費者視聽，好像加上這兩個字吃起來就比較不會有罪惡感，為了促進買氣商家真的用盡一切來銷售，儘管你的商品一點都不健康，而很多長者根本不注意商品標示看到健康二字就立即購買，我認為嚴格執行字樣規定是非常有必要的。 觀後心得後兩章節主要就是再談論美國製藥商跟食品規定協會之間的勾當，這部分就不特別紀錄，前半部的介紹比較親民，後三分之一讀起來比較硬一些（提到很多專業術語以及文獻）。 從案例切入生活，再談論到資本主義社會下的消費型態，一層層連鎖效應，不單單只是因為「吃」這件事造成的問題，在本書都有提到。 而在探討病例以及消費習慣時我會以自我檢視的角度省思，自己常常是不是也做出類似的事，就像週五莫名的犒賞自己，或是找些看似健康的零食想著吃了不會胖。消費習慣大大影響我們的生活，我們都是人，多少都會受到美食的影響，而理性的消費，正確的選擇食物，正是這本書想傳達的理念，對我來說這是本時時刻刻提醒自己的警示好書。","link":"/say-something/2021/06/11/2021-June/Book-FoodAndCultureOfConsumerism/"},{"title":"讀書心得 - 最有生產力的一年","text":"作者：克里斯．貝利（Chris Bailey） 我的評分：★★★ 不知道你會不會跟我一樣會把「今日計畫寫下來」，但往往能完成的卻不是全部，思考著我今天到底都做了什麼？焦慮跟緊張油然而生。如果你會這樣的話，那有空可以翻閱這本書，或許你會跟我一樣有些行動上體悟。而這本書就是在介紹如何在各種情境下產出最高生產力。 三重點法則 一、每一天開始，把心念快轉到一天結束的時候，並問自己：當這一天結束，希望做完哪三件事情？把這三件事情寫下來。 二、每週一開始，做上述同樣的動作。 你所確認的這三件事情，將會是你這一天，以及這一週的焦點。 作者提到三的思維習慣，為什麼要設定三？而不是四或五？我們平常在思考或是敘述通常會拿兩件事來當做例子，而「三」是人類普遍最為喜歡的思考的數字，就像是為什麼童話故事是三劍客、三隻小豬，亦或是冠軍是前三名（冠軍、亞軍、季軍）、金牌、銀牌、銅牌等等…這都說明了人類被訓練用三來做思考。而三重點其實就像上述的那樣簡單，想要完成什麼，以那三項為主。以前我就有寫今日目標的習慣，規定自己今天要讀什麼書做什麼事，睡前再查看是否有確認做到，後來發現雖然目標完成是充滿成就感沒錯，但能真正做到完全達成的日子屈指可數，通常都把目標訂太多或是訂太高，完全達成的機會並不多。而書中提倡「三重點法則」實際執行起來看起來真的不困難，我從閱讀這本書後真的一天只訂定三項目，我的內容是這樣的 在 06/23 完成以下一、線上課程第一章全 （預估兩小時）二、練長笛並且錄一首歌 （預估一小時）三、股票作業 （預估三小時） 除了平日八小時的上班，現在 Work From Home 額外帶來的好處就是利用的時間變多了！所以只要打卡下班後我就可以立馬開始執行這三項計畫，雖然書中沒有提到時間的計算，但我覺得做計畫前都最好評估一下時間成本，像我的個性就會認為「阿～還有四小時可以做股票作業，可以摸個魚我也做得完」，可能變成最後一項很趕著完成。如果預先設定個完成時間也可以知道自己投入了多少產出這件事。以目前來說三項的目標對我來說剛剛好，有餘力就會加上第四項、第五項，我覺得設定完成事項這件事不要想的太死或太多，那只會莫名地造成自己的壓力，適度的給自己可以達到範圍內，成就感也隨之而來。 （平常會把事情寫在便利貼上） 前額葉皮質與邊緣系統這章節是書中我最喜歡的一部分（還回頭看了兩次），主要是說大腦的邊緣系統和前額葉皮質的戰鬥過程，通常我們做一件自己不喜歡的事都會一拖再拖（有時候就算是喜歡的事也會拖延），作者提到他因為寫這本書婉拒了所有正職工作，但很多時候一天沒什麼產出甚至只看了 Netflix，而之所以會引發拖延的六大因素書中提到 無趣、令人受挫、困難、毫無條理或不明確、缺乏個人意義、卻乏內在報酬（不好玩或缺乏吸引力） 先來說說邊緣系統和前額葉皮質好了，通常掌管我們情緒、本能、快樂等等感受都是在邊緣系統，它會試圖誘發拖延症、懶惰、等等可以讓身心靈感受到舒服的行為。另一個前額葉皮質則是掌握邏輯推理、奮鬥努力等等，當我們覺得想耍廢發懶的時候邊緣系統就在作祟，我自己最常發生的事就是當我在查找文件時，雖然問題沒解決，但只要找到答案後我就會擺著想著躺一下好了（？）尋找各種獎勵，但我問題根本就沒有解決XD。 不過也不要誤會邊緣系統好像很糟，這就是人類，也是天性，也有前額葉皮質戰勝的時候，像是時間到了你就會去跑步，或是你知道缺乏某些知識就去閱讀（就像我閱讀這本書一樣），但提升生產力這件事就跟前額葉皮質有關了，書中提到可以透過訓練的方式來強化我們的前額葉皮質。以上面引發拖延的六種主因來說，我們可以將無趣的事變成有趣，讓人受挫的事切割成小部分小部分達成…等等將事件改頭換面，而這種作法就是在訓練我們前額葉皮質。 檢視自我回顧一下我一天的生活發現我在使用電腦、手機上的時間其實真的算很多，平時除了工作以外需要整天盯著電腦，下班有時候真的什麼都不想做，就會開始滑手機，有幾次是滑到根本不知道要幹嘛，當時心裡也不好受（因為也不知道要幹嘛就硬滑==），我發現這對我一點幫助也沒有，反而本末倒置。 後來我只要下班運動完洗完澡就會把手機開飛航，誰都不可以打擾我，給自己一到兩小時的獨處時間，此時我會看書、練練長笛、寫寫功課、做目標事項等等（當然也不是每次都這麼順利）。書中也提到網路佔用了我們太多時間，適度的停掉網路生活對我們來說是好的，這些都是我們還需要學習適度的留給自己時間而不是留給網路時間。 觀後心得其他章節還有提到一些比較小項目增加生產力的方式，像是找尋到適合自己的黃金生產時間，有些人可能是在早上最有精神，有些人則是晚上，此時就可以安排比較重要的事項來提高生產力。額外還有像是保持運動、不喝飲料、每週冥想、適度的放鬆等等介紹我就不特別贅述。但有些章節跟段落讓我覺得有硬要湊的感覺。整體算是很平易近人的敘述，沒有過多的專業術語，以作者實驗精神角度去分享跟敘述，算是很淺顯易懂。每章節的背後都有該章節核心重點的挑戰，讓讀者有種躍躍欲試的感覺，我看完後心態確實有修正許多。而每個人生理跟心理狀態都不太一樣的情況下，我覺得也不用給自己太大壓力，像這種書或許有些人會覺得看完壓力很大（可能會想都看完了可是我也沒執行），把它當作是看一本實驗故事，適合的章節可以試試看，不適合的章節跳過也沒關係，找到最適合自己生產力的做法才是最重要的。","link":"/say-something/2021/06/30/2021-June/Book-TheProductivityProject/"},{"title":"學習回顧 - 學長笛的半年心得","text":"記得我先前的文章說道「我說畢業後有陣子都在嘗試新事物」，而長笛就是其中一件。以前學樂器都是在音樂教室學習，幾次下來不知道為什麼不是很喜歡，每次去都有些抗拒甚至感到壓力，但我知道我明明就是很喜歡聽音樂玩樂器的人，只是音樂教室不適合我罷了，所以我輾轉開始找私人家教。 去年年底在 PTT 家教版發文徵長笛家教老師，等了約一個月沒有人回覆我，想著拖下去也不是辦法，無奈準備著手往音樂教室尋找時，剛好收到現在長笛老師的來信，就這樣，不知不覺學習長笛半年了！（時間真的過好快呀…） 為什麼是長笛比起熱門的鋼琴、小提琴、吉他…等等，長笛算是跟前者那些比起較不熱門的樂器之一。 很多人問我「為什麼是長笛？」 從小到大好像學過不少樂器，但認真說學最長且有考過證書的也就一年多左右，其餘都是學約不到完整一年。小時候學的是國樂，很單純的就是媽媽喜歡，她希望孩子們能學成後彈奏給她聽，儘管那不是我喜歡的樂器，也就這樣學了一年考到金鐘國樂一二級。 後來因為學費漲價就停學了，也因為沒興趣停學後就沒有繼續練習，長大後要我再重拾頂多只演奏得出基本音階的能力。 你一定會很疑惑，為什麼不挑自己喜歡的？你以為我沒有嗎XD，很現實的是投資方說什麼，就是什麼，除非你可以為自己出錢，記得當時我要求了不下 30 次，我想學鋼琴，我得到的卻是天差地遠的國樂器，也不至於討厭，畢竟每個樂器都有獨特的聲樂，但沒興趣就不會特別想念，而我內心卻莫名鬆了一口氣。 會特別喜歡鋼琴是因為小時候看了周杰倫主演的「不能說的秘密」，劇情大意就是在說音樂學院主修鋼琴的男女主角相遇，是個奇幻的愛情校園戀愛劇，穿插著鋼琴的演奏，這部可以說是我的愛片（少說看了 10 幾次），其中最喜歡的情節就是最經典的鬥琴，可以算是我愛上鋼琴的最大原因。 直到上大學才有機會學自己喜歡的鋼琴，學校有個科系中庭有放置給人彈奏的鋼琴，當時認識了一個學姊，就這樣請她每週教我一些，持續了一學期。當時我好快樂，我喜歡彈奏鋼琴的感覺，喜歡自己彈奏出來的音樂，就算是無聊的音階練習對我來說也是件享受，但鋼琴在中庭的關係，平日白天大家要上課所以沒辦法大肆練習，我通常會在晚上十、十一點時暢快的練習兩個小時，雖說已經刻意挑比較晚的時間，還會有學生在上課而被制止（超認真，上到凌晨），因為這件事讓我變得很珍惜，珍惜每一次的練琴。 時間快轉到去年，開始工作後的某一天，媽媽突然問我「你現在有什麼想學樂器嗎？我贊助你學費半年」（我猜是看某節目有人表演樂器激起她會這樣問），我不假所思的說「鋼琴」。 無奈又回到了「投資方」的問題上，我說我可以存錢買電子琴，練琴也會戴上耳機，我想學鋼琴！媽媽一昧地否定我，還為此吵了一架，甚至差點鬧出家庭革命XD，後來還是找到了一個折衷的樂器，攜帶方便隨時可上場的「長笛」，而選長笛也是因為不能說的秘密（連結是演奏片段），真的可以說這部電影算是我啟蒙的開端。 體悟 熟能生巧、勤能補拙 每次上課一定先從無聊的長音音階練起，記得最初學的過程是吹不出聲音&gt;吹出聲音&gt;維持六秒&gt;維持八秒，到現在維持十秒，目標是到維持十二秒。遇到一首練習曲的過程是這樣的，先看小節和調號、拍子，再視譜，才開始練習吹，練習的過程別無他法，就是大量的重複練習，以我現在在練習的檢定曲來說至少每天吹個五次，如果不熟的地方會特別抽出練，就是一直練到對為止，反覆的大量練習從錯誤中學習修正，是我目前領悟的道理，且我發現好像很多事情都是這樣，透過大量的刻意練習，變成「熟能生巧」，這首曲子（或這件事）你就慢慢學會了。 上班後雖然忙，但是真的有忙到 30 分鐘都拿不出來嗎？還是只是藉口？ 這是我常常對自己說的話，很多時候並不是真的忙，忙只是一個藉口而已。（但也真的有人很忙啦，這邊我是說我自己）\b。 老師跟我說他的學生有些也是上班族，但通常都學不久，因為如果不練習又要教新的會學不起來，開始常常請假，結果一拖再拖，就變成不上課了，所以上班族很少有能堅持超過三個月。當我學剛滿三四個月時，準備要考長笛檢定，老師笑著說你讓我有點意外可以學這麼久。 其實我每次下班除了要跑健身房以外，練長笛也是我的必做項目之一，我告訴自己不管練多久，十分鐘、二十分鐘也好，或只是單純指法，每天都要抽一些時間出來，因為我知道這些一點點會讓我上課時更進步（原子習慣），我也就這樣堅持了半年，其中當然也會有想放棄想偷懶，我也不是對自己特別嚴格的人，我真的不想練我就不練，如果今天再怎麼吹都很難聽，我就設個停損點，隔兩天再回頭練習，我會給自己一個月一次請假的額度（當然最好還是上滿課）真的狀況不好當週我就會請假，如果太久沒練我反而會開始想念笛子的聲音，這些日常的習慣就這樣維持半年，直到第四個月，老師跟我說，「我們考九級檢定吧！」（長笛檢定初級為十二級） 半年的心得從長笛身上的學到的不單單只是吹奏音樂而已，練習讓我感到充實、進步、不再感焦慮。記得有位老師跟我說「學習的路上痛苦是正常的，等到熬過去，你會水到渠成，嚐到美好的果實。」要我說我現在嚐到果實了嗎？當然還沒，但至少這個痛苦的過程是有成長有進步的，我清楚瞭解自己不會隨便放棄，長笛這條路很長很遠，期許能在道路上持續成長。 這邊很感謝我的長笛老師，溫老師，她真的是又溫柔又有耐心，吹不好覺得灰心的時候老師都鼓勵我，說吹不好都是常有的事，慢慢就會了\b。在這條路上有一位好的老師的陪伴讓我覺得真的是福氣，很謝謝老師這半年的教導，未來還要繼續麻煩老師了呢^^。","link":"/say-something/2021/06/17/2021-June/Learning-Flute/"},{"title":"我的個人部落格","text":"我為什麼想建立這個部落格去年就有建立了一個紀錄技術跟生活的 Blog，現在想要確切地把兩者分開，生活是生活，技術是技術。 我發現紀錄生活對我來說很重要，每月結束時回頭看自己的文章，除了有滿滿的成就感以外也可以知道我都做了些什麼、去了哪些地方，也可以瞭解過去的自己的想法是不是跟現在的我有所差別。 而我也可以很直白的說，這就是寫給自己看的部落格。不吝嗇地公開（不過可能也只有我會看XD），也期望與更多人交流，如果你想認識我也歡迎大方的與我聯絡，任何事都可以！ The power of now.","link":"/say-something/2021/05/31/2021-June/FreshOffTheBoat/"}],"tags":[{"name":"讀書心得","slug":"讀書心得","link":"/say-something/tags/%E8%AE%80%E6%9B%B8%E5%BF%83%E5%BE%97/"},{"name":"Book","slug":"Book","link":"/say-something/tags/Book/"},{"name":"雜記","slug":"雜記","link":"/say-something/tags/%E9%9B%9C%E8%A8%98/"},{"name":"二零二一","slug":"二零二一","link":"/say-something/tags/%E4%BA%8C%E9%9B%B6%E4%BA%8C%E4%B8%80/"},{"name":"Remind","slug":"Remind","link":"/say-something/tags/Remind/"},{"name":"成長","slug":"成長","link":"/say-something/tags/%E6%88%90%E9%95%B7/"},{"name":"想法","slug":"想法","link":"/say-something/tags/%E6%83%B3%E6%B3%95/"},{"name":"學習","slug":"學習","link":"/say-something/tags/%E5%AD%B8%E7%BF%92/"},{"name":"other","slug":"other","link":"/say-something/tags/other/"}],"categories":[{"name":"讀書心得","slug":"讀書心得","link":"/say-something/categories/%E8%AE%80%E6%9B%B8%E5%BF%83%E5%BE%97/"},{"name":"雜記","slug":"雜記","link":"/say-something/categories/%E9%9B%9C%E8%A8%98/"},{"name":"Remind","slug":"Remind","link":"/say-something/categories/Remind/"},{"name":"成長","slug":"成長","link":"/say-something/categories/%E6%88%90%E9%95%B7/"},{"name":"學習","slug":"學習","link":"/say-something/categories/%E5%AD%B8%E7%BF%92/"},{"name":"其他","slug":"其他","link":"/say-something/categories/%E5%85%B6%E4%BB%96/"}]}