{"pages":[{"title":"關於我","text":"1997 年生，是個理性大於感性的人類。想要好好生活就要好好紀錄！所以這邊常常分享一些我的心情雜記。有任何想交流的歡迎大方的按右上角的 IG、FB 與我聯絡～(*´∀`)~♥","link":"/say-something/about/index.html"},{"title":"分類","text":"","link":"/say-something/categories/index.html"},{"title":"tags","text":"","link":"/say-something/tags/index.html"},{"title":"友情連結","text":"It’s Coding Time趙萌 – 可愛又迷人A反派角色","link":"/say-something/friends/index.html"}],"posts":[{"title":"興趣使然的東西，不會讓你忘記","text":"先想想，如果別人問你：「你的興趣是什麼？」你會怎麼回答？ 先說我好了，以前的我大概會說「我好像沒有什麼特別的興趣耶…」，大學期間儘管參加了一堆社團（熱舞社、網球社等等..），也都只是三分鐘熱度，似乎沒有真正能引起我注意的事情，但唯獨一件讓我從小持續到現在的事大概只有「閱讀」了吧！ 嘗試並不吃虧撇除掉閱讀這件事，從 20 年畢業，我確定自己的工作方向後就開始廣泛式的嘗試任何事情，一方面是覺得我現在還有時間可以去嘗試，一方面是覺得我還年輕還有體力，這就是我的本錢，我沒道理（？）不去揮霍，所以我開始做一些我沒做過的事，像是去高級餐廳、買幾件昂貴的衣服、開始上健身房、開始爬山、認識新朋友、學習新東西…等等，說起來好笑，幾位朋友聽到我開始做這些事，他們嘲弄著我說「辰宣，你又在解成就哦？」，是！就是在解成就XD去年畢業知道自己找工作的方向，不從容的我給了自己一個月的 Gap Month，開始做一些新的嘗試，從最一開始的上健身房，想著「我就來看看我堅持三個月會怎樣？」，痛苦又漫長的三個月過去後，體脂降了約 3-4%，嚐到甜頭後就開始加入重訓，最瘋狂的時期甚至每天都去健身房運動兩小時，就這樣也默默堅持了七八個月到現在，說自己健身上癮真的也不為過，但最大的收穫應該還是體脂降了 10 幾 % 體重降了約十公斤吧！從油膩膩的泡芙變成稍微結實「看起來有在健身」的人。（之後會寫一篇心得，敬請期待）體力好之後開始接觸爬山，第一次就爬了崩潰的谷關八唐縱走（附上連結，哪有人第一次爬山就爬 10、11 小時的稜線縱走啦！），自以為有上健身房體力不差，結果邊爬邊擦眼淚，想著我幹嘛沒事找事做，結果一下山又開始想「下一座要爬什麼好呢？」，真的是越虐我越愛（？）從此刻開始我不停的爬山。 結果，愛上爬山這件事，成為了我興趣之一！ 成為興趣，然後呢無奈身邊的朋友們都不太喜歡爬山（也是啦，又熱、又累、又曬完全可以理解每次邀約他們都被拒絕的原因），我開始網路上找團跟，臉皮厚的我甚至組了一個登山社團，開始號招大家來爬山，只要有開團有缺人我就跟，半年下來爬了十幾座山，除了中部的山以外，我開始查其他縣市的山，像是七星山、抹茶山、旗靈山等等，看著網路上的分享默默把名單放入我的爬山清單中。後來我發現，當朋友問我什麼什麼山在哪或是哪團在揪人去哪座山的時候，我竟然可以完全不用查在哪，大概是什麼等級的山，這些資訊在我腦海中就浮現出來了（順口的講出來朋友甚至以為我都去過lol），我才意識到原來我感興趣的東西，會不自覺得去查相關資訊，不自覺得記入腦海中！我因為喜歡所以自己組了社團、做了很多功課，這些事如果是以前的我一定會覺得「蛤，好麻煩哦」，沒想到卻因為一次的崩潰縱走讓我愛上爬山，跟健身一樣完全上癮，有陣子因為工作比較忙當月沒有爬山我反而覺得心裡空空的，就像失戀的感覺一樣XD，此後每個月固定一次的爬山行程就納入我的行事曆了。 嘗試後變成了興趣，興趣卻讓你忘不了我想到在 19 年我申請上了北京交換生，其中最讓我印象深刻的是我和朋友一起去紫禁城遊玩，想說來穿個古裝拍照留下美好的紀念，在城旁租了一整套的古裝，當時幫我們上妝的小姐在為我們挑選古裝時，熱情的介紹著哪些服裝是哪個年代，哪些飾品是她手工製作，哪些古裝這樣設計的意涵，我看到她身上散發著光芒，我知道那是她的興趣，儘管工作室不到 15 坪小房間，也包不住她喜愛的事物！當時的我無法體會，但我知道她很享受她的興趣和工作。 連上妝她都很熱心跟我們介紹古裝的妝容是怎樣的 而從爬山這件事，我領悟到喜歡的東西你會花時間做研究、廣泛的搜尋，但卻樂在其中，如果今天遇到同好，你的眼睛會閃閃發光，因為你知道有人的興趣跟你一樣，就像為我們打扮古裝的小姐，熱情的分享自己的所愛。爾後，我也持續嘗試了很多東西，一直堅持下去的當然不只爬山這件事，很感謝一開始自己願意踏出這一步，願意嘗試，從中找到樂趣，給自己一些甜頭，慢慢地堅持下去，儘管過程有崩潰、有難過，也不會隨便放棄，因為你知道這是你喜歡的事！最後，我想說的是不要害怕嘗試，失敗了也沒關係，找到自己的興趣，享受其中！ 用美美的照片收尾!","link":"/say-something/2021/06/08/20210608-AboutHabit/"},{"title":"讀書心得 - 過度飲食心理學：當人生只剩下吃是唯一慰藉","text":"","link":"/say-something/2021/06/08/20210608-FoodAndCultureOfConsumerism/"},{"title":"Fresh off the boat!","text":"初來乍到！去年就有建立了一個紀錄技術跟生活的 Blog，現在想要確切地把兩者分開，生活是生活，技術是技術。 我發現紀錄生活對我來說很重要，每月結束時回頭看自己的文章，除了有滿滿的成就感以外也可以知道我都做了些什麼、去了哪些地方，我可以很直白的說，這就是寫給自己看的部落格。我也不吝嗇地公開（不過可能也只有我會看XD），也期望與更多人交流，如果你想認識我也歡迎大方的與我聯絡，任何事都可以！ The power of now.","link":"/say-something/2021/05/31/FreshOffTheBoat/"}],"tags":[{"name":"想法","slug":"想法","link":"/say-something/tags/%E6%83%B3%E6%B3%95/"},{"name":"心情","slug":"心情","link":"/say-something/tags/%E5%BF%83%E6%83%85/"},{"name":"讀書心得","slug":"讀書心得","link":"/say-something/tags/%E8%AE%80%E6%9B%B8%E5%BF%83%E5%BE%97/"},{"name":"Book","slug":"Book","link":"/say-something/tags/Book/"},{"name":"other","slug":"other","link":"/say-something/tags/other/"}],"categories":[{"name":"心情","slug":"心情","link":"/say-something/categories/%E5%BF%83%E6%83%85/"},{"name":"讀書心得","slug":"讀書心得","link":"/say-something/categories/%E8%AE%80%E6%9B%B8%E5%BF%83%E5%BE%97/"},{"name":"其他","slug":"其他","link":"/say-something/categories/%E5%85%B6%E4%BB%96/"}]}